NXP/GenAVB_TSN-rtos-apps/devices/MIMXRT118x/common/cm7/iar/startup_MIMXRT118x_cm7.s
        PUBWEAK DMA4_CH16_CH17_CH48_CH49_IRQHandler
        PUBWEAK DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH16_CH17_CH48_CH49_IRQHandler
        LDR     R0, =DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH18_CH19_CH50_CH51_IRQHandler
        PUBWEAK DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH18_CH19_CH50_CH51_IRQHandler
        LDR     R0, =DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH20_CH21_CH52_CH53_IRQHandler
        PUBWEAK DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH20_CH21_CH52_CH53_IRQHandler
        LDR     R0, =DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH22_CH23_CH54_CH55_IRQHandler
        PUBWEAK DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH22_CH23_CH54_CH55_IRQHandler
        LDR     R0, =DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH24_CH25_CH56_CH57_IRQHandler
        PUBWEAK DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH24_CH25_CH56_CH57_IRQHandler
        LDR     R0, =DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH26_CH27_CH58_CH59_IRQHandler
        PUBWEAK DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH26_CH27_CH58_CH59_IRQHandler
        LDR     R0, =DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH28_CH29_CH60_CH61_IRQHandler
        PUBWEAK DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH28_CH29_CH60_CH61_IRQHandler
        LDR     R0, =DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH30_CH31_CH62_CH63_IRQHandler
        PUBWEAK DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH30_CH31_CH62_CH63_IRQHandler
        LDR     R0, =DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
        BX      R0

        PUBWEAK XBAR1_CH0_CH1_IRQHandler
        PUBWEAK XBAR1_CH2_CH3_IRQHandler
        PUBWEAK SINC3_CH0_CH1_CH2_CH3_IRQHandler
        PUBWEAK EWM_IRQHandler
        PUBWEAK SEMC_IRQHandler
        PUBWEAK LPIT3_IRQHandler
        PUBWEAK LPTMR3_IRQHandler
        PUBWEAK TMR4_IRQHandler
        PUBWEAK LPI2C5_IRQHandler
        PUBWEAK LPI2C5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C5_IRQHandler
        LDR     R0, =LPI2C5_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C6_IRQHandler
        PUBWEAK LPI2C6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C6_IRQHandler
        LDR     R0, =LPI2C6_DriverIRQHandler
        BX      R0

        PUBWEAK SAI4_IRQHandler
        PUBWEAK SAI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI4_IRQHandler
        LDR     R0, =SAI4_DriverIRQHandler
        BX      R0

        PUBWEAK SPDIF_IRQHandler
        PUBWEAK SPDIF_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SPDIF_IRQHandler
        LDR     R0, =SPDIF_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART9_IRQHandler
        PUBWEAK LPUART9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART9_IRQHandler
        LDR     R0, =LPUART9_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART10_IRQHandler
        PUBWEAK LPUART10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART10_IRQHandler
        LDR     R0, =LPUART10_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART11_IRQHandler
        PUBWEAK LPUART11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART11_IRQHandler
        LDR     R0, =LPUART11_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART12_IRQHandler
        PUBWEAK LPUART12_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART12_IRQHandler
        LDR     R0, =LPUART12_DriverIRQHandler
        BX      R0

        PUBWEAK INTG_BOOTROM_DEBUG_CTRL_IRQHandler
        PUBWEAK EDGELOCK_REQ1_IRQHandler
        PUBWEAK EDGELOCK_REQ2_IRQHandler
        PUBWEAK EDGELOCK_REQ3_IRQHandler
        PUBWEAK TMR3_IRQHandler
        PUBWEAK JTAGC_IRQHandler
        PUBWEAK M33_SYSRESET_REQ_IRQHandler
        PUBWEAK M33_LOCKUP_IRQHandler
        PUBWEAK M7_SYSRESET_REQ_IRQHandler
        PUBWEAK M7_LOCKUP_IRQHandler
        PUBWEAK PWM2_FAULT_IRQHandler
        PUBWEAK PWM2_0_IRQHandler
        PUBWEAK PWM2_1_IRQHandler
        PUBWEAK PWM2_2_IRQHandler
        PUBWEAK PWM2_3_IRQHandler
        PUBWEAK PWM3_FAULT_IRQHandler
        PUBWEAK PWM3_0_IRQHandler
        PUBWEAK PWM3_1_IRQHandler
        PUBWEAK PWM3_2_IRQHandler
        PUBWEAK PWM3_3_IRQHandler
        PUBWEAK PWM4_FAULT_IRQHandler
        PUBWEAK PWM4_0_IRQHandler
        PUBWEAK PWM4_1_IRQHandler
        PUBWEAK PWM4_2_IRQHandler
        PUBWEAK PWM4_3_IRQHandler
        PUBWEAK EQDC1_IRQHandler
        PUBWEAK EQDC2_IRQHandler
        PUBWEAK EQDC3_IRQHandler
        PUBWEAK EQDC4_IRQHandler
        PUBWEAK ADC2_IRQHandler
        PUBWEAK DCDC_IRQHandler
        PUBWEAK CAN3_IRQHandler
        PUBWEAK CAN3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN3_IRQHandler
        LDR     R0, =CAN3_DriverIRQHandler
        BX      R0

        PUBWEAK CAN3_ERROR_IRQHandler
        PUBWEAK CAN3_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN3_ERROR_IRQHandler
        LDR     R0, =CAN3_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DAC_IRQHandler
        PUBWEAK LPSPI5_IRQHandler
        PUBWEAK LPSPI5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI5_IRQHandler
        LDR     R0, =LPSPI5_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI6_IRQHandler
        PUBWEAK LPSPI6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI6_IRQHandler
        LDR     R0, =LPSPI6_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART7_IRQHandler
        PUBWEAK LPUART7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART7_IRQHandler
        LDR     R0, =LPUART7_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART8_IRQHandler
        PUBWEAK LPUART8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART8_IRQHandler
        LDR     R0, =LPUART8_DriverIRQHandler
        BX      R0

        PUBWEAK SAI2_IRQHandler
        PUBWEAK SAI2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI2_IRQHandler
        LDR     R0, =SAI2_DriverIRQHandler
        BX      R0

        PUBWEAK SAI3_IRQHandler
        PUBWEAK SAI3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI3_IRQHandler
        LDR     R0, =SAI3_DriverIRQHandler
        BX      R0

